docs/reviews/realfluid-baseline-001/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 -0.1 -0.1)  //0
    ( 1 -0.1 -0.1)  //1
    ( 1  0.1 -0.1)  //2
    ( 0  0.1 -0.1)  //3
    ( 0 -0.1  0.1)  //4
    ( 1 -0.1  0.1)  //5
    ( 1  0.1  0.1)  //6
    ( 0  0.1  0.1)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1500 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    /*
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 4 7 3)
        );
    }
    */

    periodic1
    {
        type cyclic;
        neighbourPatch  periodic2;
        faces
        (
            //(1 2 6 5)
            (0 4 7 3)
        );
    }

    periodic2
    {
        type cyclic;
        neighbourPatch  periodic1;
        faces
        (
            (1 2 6 5)
            //(0 4 7 3)
        );
    }

    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
